import MeliPayamak from "melipayamak"

const api = new MeliPayamak(process.env.SMS_USERNAME, process.env.SMS_PASSWORD + "$" + process.env.SMS_PASSWORD2);

const sms = api.sms();

export const smsResponseCode = {
    0: "نام کاربری یا رمز عبور اشتباه می باشد.",
    2: "اعتبار کافی نمی باشد.",
    3: "محدودیت در ارسال روزانه",
    4: "محدودیت در حجم ارسال",
    5: "شماره فرستنده معتبر نمی باشد.",
    6: "سامانه در حال بروزرسانی می باشد.",
    7: "متن حاوی کلمه فیلتر شده می باشد.",
    9: "ارسال از خطوط عمومی از طریق وب سرویس امکان پذیر نمی باشد.",
    10: "کاربر مورد نظر فعال نمی باشد.",
    11: "ارسال نشده",
    12: "مدارک کاربر کامل نمی باشد.",
    14: "متن حاوی لینک می باشد.",
    15: "ارسال به بیش از 1 شماره همراه بدون درج \"لغو11\" ممکن نیست.",
    16: "شماره گیرنده ای یافت نشد",
    17: "متن پیامک خالی می باشد",
    18: "شماره گیرنده نامعتبر است",
    35:  "اسم شما در لیست سیاه مخایرات است"
}


export default sms